/**
  ******************************************************************************
  *
  * @file      commonCMD.c
  *
  * @brief     Обработка команд общего (common) типа.
  *
  * @details   
  *            
  * @warning   **ВАЖНО!** \n 
  * Для работы необходимы библиотечные заголовочные файлы перечисленные в блоке Includes. \n 
  * Кроме того требуется:
  *                       + файл .с - файл;
  *                       + файл .h - header for .с.
  *
  * **Manual**
  * Модуль commonCMD.c обеспечивает:
  * - parsing (анализ) сообщения, поступившего от контроллера (RAPIDA) в модуль (микроконтроллер STM, GD, AT),
  *   в случае, если во входящем сообщении в EXID (Extended format frame identifier), поле "Тип интерфейса" имеет значение 0. \n 
  *   Если поле "Тип интерфейса" имеет значение 0, то поступила команда типа "Общая" (common).
  *
  * - вызов требуемой (по результатам анализа) команды и/или формирование ответного сообщения из модуля в контроллер.
  *
  * - вызов при необходимости команды отправки сформированного ответа в передающий буфер CAN.
  *
  * 
  * @copyright Copyright (C) 2022 Awada Systems. Все права защищены.
  *
  * @author    Larionov A.S. (larion.alex@mail.ru)
  *
  ******************************************************************************
**/

//---Includes-------------------------------------------------------------------//
#include "commonCMD.h"
//------------------------------------------------------------------------------//

//---Private macros ------------------------------------------------------------//
#define COMMAND_MASK                   0x3F  /*!< Маска поля тип команды.             */

#define MODULE_INFO_REQUEST            0x00  /*!< Запрос информации о модуле.         */
#define MODULE_SN_REQUEST              0x01  /*!< Запрос серийного номера модуля.     */
#define MODULE_INTERFACE_TYPES_REQUEST 0x02  /*!< Запрос типов интерфейсов модуля.    */
#define MCU_DATA_REQUEST               0x03  /*!< Запрос данных микроконтроллера.     */
#define UID_REQUEST                    0x04  /*!< Запрос UID.                         */
#define MODULE_STATE_REQUEST           0x05  /*!< Запрос состояния модуля.            */
#define SILENCE_MODE                   0x06  /*!< Режим тишины.                       */

#define MODULE_ADDRESS_CHANGE          0x30  /*!< Смена адреса модуля.                */
#define CAN_MODULE_SPEED_CHANGE        0x31  /*!< Смена скорости CAN модуля.          */
#define EXECUTING_PROTECTED_CMD        0x3D  /*!< Выполнение защищенной команды.      */
#define MODULE_OVERLOAD                0x3E  /*!< Перезагрузка модуля.                */
#define SUPPORTED_COM_CMD_REQUEST      0x3F  /*!< Запрос поддерживаемых общих команд. */
//------------------------------------------------------------------------------//

//---Exported variables---------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private types--------------------------------------------------------------//
//uint8_t ComCMDtype [12] = {};
//------------------------------------------------------------------------------//

//---Private variables----------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private constants----------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Function prototypes--------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Exported functions---------------------------------------------------------//
void ParsingComCmd (canRxMsgBuf_struct* canRxMsg)
{
uint8_t CMD_type = ((canRxMsg->cmd13param >> 6) & COMMAND_MASK);

switch (CMD_type)
{
case (MODULE_INFO_REQUEST):
  
  
  break;

case (MODULE_SN_REQUEST):
  break;

default:
  break;
}









}
//------------------------------------------------------------------------------//



//---Private functions----------------------------------------------------------//
//------------------------------------------------------------------------------//









//***************************************END OF FILE**************************************//
