/**
  ******************************************************************************
  *
  * @file      MCU.c
  *
  * @brief     Функции для работы с MCU.
  *
  * @details   Файл MCU.c содержит функции для работы с различными периферийными блоками микроконтроллеров (STM, GD, AT).
  *            Поскольку функций немного и каждая из них относится
  *            
  * @warning   **ВАЖНО!** \n 
  * Для работы необходимы библиотечные заголовочные файлы перечисленные в блоке Includes. \n 
  * Кроме того требуется:
  *                       + файл .с - файл;
  *                       + файл .h - header for .с.
  *
  * **Manual**
  * 
  * @copyright Copyright (C) 2022 Awada Systems. Все права защищены.
  *
  * @author    Larionov A.S. (larion.alex@mail.ru)
  *
  ******************************************************************************
**/

//---Includes-------------------------------------------------------------------//
#include "MCU.h"
//------------------------------------------------------------------------------//

//---Private macros ------------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Exported variables---------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private types--------------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private variables----------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Private constants----------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Function prototypes--------------------------------------------------------//
//------------------------------------------------------------------------------//

//---Exported functions---------------------------------------------------------//
/**
@brief __weak функция инициализации целевого микроконтроллера.
@param  None
@return None.
*/
__weak void MCU_Init (void)
{;}
//------------------------------------------------------------------------------//


/**
  * @brief   __weak функция System Reset.
  * @details Initiates a system reset request to reset the MCU.
  * @return  None.
  */
__weak void SystemReset (void)
{;}
//------------------------------------------------------------------------------//


/**
  * @brief   __weak функция - чтение Unique device ID.
  * @details Чтение значения Unique device ID в используемом микроконтроллере (STM, GD, AT).
  * @param   IDarray - указатель на массив типа uint32_t. Массив содержит Unique device ID.
  * @return  None.
  */
__weak void Read_MCU_UID (uint32_t* IDarray)
{;}
//------------------------------------------------------------------------------//


/**
  * @brief   __weak функция - чтение кода причины перезапуска.
  * @details Функция возвращает код причины перезапуска модуля (микроконтроллера (STM, GD, AT)).
  * @return  None.
  */
__weak uint8_t ReadReasonForReboot (void)
{
return 0;
}
//------------------------------------------------------------------------------//




/**
  * @brief   __weak функция - мигалка.
  * @return  None.
  */
__weak void Blink (void)
{;}
//------------------------------------------------------------------------------//


//---Private functions----------------------------------------------------------//
//------------------------------------------------------------------------------//


//***************************************END OF FILE**************************************//
